src/TaskManager/src/Catalogs/мзМетоды/мзМетоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мзМетоды</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидМетода</name>
    <type>
      <types>EnumRef.мзВидыМетодов</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/TaskManager/src/Enums/мзВидыМетодов/мзВидыМетодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мзВидыМетодов</name>
  <enumValues>
    <name>ВызовМетода</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйАлгоритм</name>
  </enumValues>
</mdclass:Enum>

src/TaskManager/src/Catalogs/мзМетоды/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидМетодаПриИзменении(Элемент)
	УстановитьТекущуюСтраницуПоВидуМетода();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьТекущуюСтраницуПоВидуМетода();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтраницуПоВидуМетода()
	
	Если Объект.ВидМетода = ПредопределенноеЗначение("Перечисление.мзВидыМетодов.ВызовМетода") Тогда
		Элементы.СтраницыВидыМетода.ТекущаяСтраница = Элементы.СтраницаПроизвольныйАлгоритм;
	ИначеЕсли Объект.ВидМетода = ПредопределенноеЗначение("Перечисление.мзВидыМетодов.ПроизвольныйАлгоритм") Тогда
		Элементы.СтраницыВидыМетода.ТекущаяСтраница = Элементы.СтраницаПроизвольныйАлгоритм;
		
	Иначе
		Элементы.СтраницыВидыМетода.ТекущаяСтраница = Элементы.СтраницаПусто;
	КонецЕсли;
			
КонецПроцедуры
